public/aliases.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-09-18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Mike&rsquo;s Alias Collection</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Mike Hostetler">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="/favicon.ico" />
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body>
<main id="content">
<header>
<h1 class="title">Mike&rsquo;s Alias Collection</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd6d174c">Hey can we all see this</a></li>
<li><a href="#org9700f41">Quick and Dirty things</a>
<ul>
<li><a href="#org6ac3383">Docker</a></li>
<li><a href="#org3aa944e">Random git stuff</a></li>
<li><a href="#orgb05e4b8">Grails stuff</a></li>
<li><a href="#orgc910e56">Misc Fun</a></li>
</ul>
</li>
<li><a href="#orgee3678d">Functions</a></li>
</ul>
</div>
</nav>
<p>
<a href="Makefile#orgf3d592d">The final ~/.aliases file</a>
</p>

<section id="outline-container-orgd6d174c" class="outline-2">
<h2 id="orgd6d174c">Hey can we all see this</h2>
</section>

<section id="outline-container-org9700f41" class="outline-2">
<h2 id="org9700f41">Quick and Dirty things</h2>
<div class="outline-text-2" id="text-org9700f41">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> <span class="org-variable-name">devBoot</span>=<span class="org-string">"SPRING_PROFILES_ACTIVE=localdb gradle bootRun"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gitdev</span>=<span class="org-string">"git pull origin dev"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">l</span>=<span class="org-string">"ls -l"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">unzip</span>=<span class="org-string">"unzip -q"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">srcstatus</span>=<span class="org-string">"svn status src"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">srccommit</span>=<span class="org-string">"svn commit src"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">edit</span>=$<span class="org-variable-name">EDITOR</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">dl</span>=<span class="org-string">'dirs -v'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">c</span>=clear
<span class="org-builtin">alias</span> <span class="org-variable-name">grep</span>=<span class="org-string">"grep --color=auto "</span>
</pre>
</div>
</div>

<div id="outline-container-org6ac3383" class="outline-3">
<h3 id="org6ac3383">Docker</h3>
<div class="outline-text-3" id="text-org6ac3383">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">dockup</span>=<span class="org-string">"docker-compose up -d"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">dockdown</span>=<span class="org-string">"docker-compose down"</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-org3aa944e" class="outline-3">
<h3 id="org3aa944e">Random git stuff</h3>
<div class="outline-text-3" id="text-org3aa944e">
<p>
Most of things require <a href="https://github.com/geelen/git-smart">git-smart</a>. And has been replaced by Magit, but once in a while I still use them
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">gss</span>=<span class="org-string">'git status --short'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gl</span>=<span class="org-string">'git smart-log'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gm</span>=<span class="org-string">'git smart-merge'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gup</span>=<span class="org-string">'git smart-pull'</span>


</pre>
</div>
</div>
</div>

<div id="outline-container-orgb05e4b8" class="outline-3">
<h3 id="orgb05e4b8">Grails stuff</h3>
<div class="outline-text-3" id="text-orgb05e4b8">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">gclean</span>=<span class="org-string">"grails clean"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gapp</span>=<span class="org-string">"grails clean &amp;&amp; grails run-app"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gtest</span>=<span class="org-string">"grails clean &amp;&amp; grails test-app"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">gwar</span>=<span class="org-string">"grails clean &amp;&amp; grails war"</span>


</pre>
</div>
</div>
</div>

<div id="outline-container-orgc910e56" class="outline-3">
<h3 id="orgc910e56">Misc Fun</h3>
<div class="outline-text-3" id="text-orgc910e56">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">alias</span> <span class="org-variable-name">weather</span>=<span class="org-string">"curl wttr.in"</span>

</pre>
</div>
</div>
</div>
</section>
<section id="outline-container-orgee3678d" class="outline-2">
<h2 id="orgee3678d">Functions</h2>
<div class="outline-text-2" id="text-orgee3678d">
<p>
I found it difficult to add parameters to my aliases but found in zsh anyway (and probably bash) that I could use functions. This was also handy for multi-line aliases. Instead of a bunch of little scripts around, I keep them in here as shell functions.
</p>

<p>
This is uses the Yubikey command line interface to find my 2FA codes. Goodbye GUI, hello CLI. Installed with <code>port install ykman</code>. see <a href="https://support.yubico.com/support/solutions/articles/15000012643-yubikey-manager-cli-ykman-user-guide#ykman_oathfmulw6">https://support.yubico.com/support/solutions/articles/15000012643-yubikey-manager-cli-ykman-user-guide#ykman_oathfmulw6</a>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">yubi</span> ()  {

 ykman oath code $<span class="org-variable-name">1</span> 
}

</pre>
</div>

<p>
Misc ones I&rsquo;ve had forever
</p>
<div class="org-src-container">
<pre class="src src-sh">

<span class="org-keyword">function</span> <span class="org-function-name">newlibs</span> ()  {
         svn status lib|egrep <span class="org-string">"^\?"</span>|gawk -F/ <span class="org-string">'{print "${project.lib.dir}/"$2":\\"}'</span>
}
<span class="org-keyword">function</span> <span class="org-function-name">lookwar</span>() {
         unzip -c $<span class="org-variable-name">1</span>.ear $<span class="org-variable-name">1</span>.war|jar t
}

<span class="org-keyword">function</span> <span class="org-function-name">addsrcs</span>() {
         srcstatus|egrep <span class="org-string">"^\?"</span>| awk <span class="org-string">'{print $2}'</span>|xargs svn add
}
<span class="org-keyword">function</span> <span class="org-function-name">grepJars</span>() {

         <span class="org-keyword">for</span> x<span class="org-keyword"> in</span> <span class="org-sh-quoted-exec">`find . -name "*.jar"`</span>; <span class="org-keyword">do</span>
             <span class="org-builtin">echo</span> $<span class="org-variable-name">x</span>
            unzip -l $<span class="org-variable-name">x</span>|grep $<span class="org-variable-name">1</span>
    <span class="org-keyword">done</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">svnstat</span>() {
         <span class="org-variable-name">tmpfile</span>=/tmp/svn-diff.$<span class="org-variable-name">$</span>
         svn diff <span class="org-string">"$@"</span> &gt; $<span class="org-variable-name">tmpfile</span>
         <span class="org-builtin">typeset</span> -i added removed delta
         <span class="org-variable-name">added</span>=$(<span class="org-sh-quoted-exec">grep</span> <span class="org-string">'^+'</span> $<span class="org-variable-name">tmpfile</span> | wc -l)
         <span class="org-variable-name">removed</span>=$(<span class="org-sh-quoted-exec">grep</span> <span class="org-string">'^-'</span> $<span class="org-variable-name">tmpfile</span> | wc -l)
         <span class="org-variable-name">delta</span>=$((added - removed))
         <span class="org-keyword">if</span> [ $<span class="org-variable-name">delta</span> -lt 0 ]; <span class="org-keyword">then</span>
             <span class="org-variable-name">deltachr</span>=&#8221;-&#8221;
         <span class="org-keyword">elif</span> [ $<span class="org-variable-name">delta</span> -eq 0 ]; <span class="org-keyword">then</span>
             <span class="org-variable-name">deltachr</span>=&#8221; &#8221;
         <span class="org-keyword">else</span>
             <span class="org-variable-name">deltachr</span>=&#8221;+&#8221;
         <span class="org-keyword">fi</span>
         svn status
         <span class="org-builtin">echo</span> &#8221; + ${<span class="org-variable-name">added</span>} lines&#8221;
         <span class="org-builtin">echo</span> &#8221; - ${<span class="org-variable-name">removed</span>} lines&#8221;
         <span class="org-builtin">echo</span> &#8221; ${<span class="org-variable-name">deltachr</span>} ${<span class="org-variable-name">delta</span>} lines overall&#8221;
         rm -f $<span class="org-variable-name">tmpfile</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">listwar</span>() {
         <span class="org-variable-name">appname</span>=$(<span class="org-sh-quoted-exec">echo</span> $<span class="org-variable-name">PWD</span>|awk -F/ <span class="org-string">'{print $NF}'</span>)

         unzip -l build/war/$<span class="org-variable-name">appname</span>.war
}

<span class="org-keyword">function</span> <span class="org-function-name">listear</span>() {
         <span class="org-variable-name">appname</span>=$(<span class="org-sh-quoted-exec">echo</span> $<span class="org-variable-name">PWD</span>|awk -F/ <span class="org-string">'{print $NF}'</span>)

         unzip -l build/ear/$<span class="org-variable-name">appname</span>.ear
}
<span class="org-keyword">function</span> <span class="org-function-name">listjar</span>() {
         <span class="org-variable-name">appname</span>=$(<span class="org-sh-quoted-exec">echo</span> $<span class="org-variable-name">PWD</span>|awk -F/ <span class="org-string">'{print $NF}'</span>)

         unzip -l build/lib/$<span class="org-variable-name">appname</span>.jar
}
<span class="org-keyword">function</span> <span class="org-function-name">winmacaddr</span>() {
         ipconfig /all|grep <span class="org-string">"Physical Address"</span>|awk -F : <span class="org-string">'{print $2}'</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">testerror</span>() {

         <span class="org-variable-name">file</span>=$(<span class="org-sh-quoted-exec">find</span> build/test/reports -name <span class="org-string">"TEST-*$1*"</span>)
         less $<span class="org-variable-name">file</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">findGrep</span>() {
find $<span class="org-variable-name">1</span> -name <span class="org-string">"$2"</span> |xargs grep $<span class="org-variable-name">3</span>

}
funtion empty() {
        rm $<span class="org-variable-name">1</span>
        touch $<span class="org-variable-name">1</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">ldirs</span>() {
         (( <span class="org-variable-name">count</span>=0))
         <span class="org-keyword">for</span> x<span class="org-keyword"> in</span> $(<span class="org-sh-quoted-exec">dirs</span>); <span class="org-keyword">do</span>
            <span class="org-builtin">echo</span> <span class="org-string">"+$count\t$x"</span>
            ((<span class="org-variable-name">count</span>+=1))
         <span class="org-keyword">done</span>
}


<span class="org-keyword">function</span> <span class="org-function-name">jconsole</span>() {
         <span class="org-variable-name">thisdir</span>=$<span class="org-variable-name">PWD</span>
         <span class="org-builtin">cd</span> $<span class="org-variable-name">JAVA_HOME</span>/bin/
         ./jconsole -pluginpath  ../demo/scripting/jconsole-plugin/jconsole-plugin.jar &amp;

         <span class="org-builtin">cd</span> $<span class="org-variable-name">thisdir</span>

}

<span class="org-keyword">function</span> <span class="org-function-name">mkdatedir</span>() {
    mkdir <span class="org-sh-quoted-exec">`date +%Y%m%d%H%M`</span>
}

</pre>
</div>
</div>

<div id="outline-container-org12c929b" class="outline-4">
<h4 id="org12c929b">client-specific</h4>
<div class="outline-text-4" id="text-org12c929b">
<div class="org-src-container">
<pre class="src src-sh">
<span class="org-builtin">source</span> ~/.private-aliases

</pre>
</div>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<p>
<p class="Source">Source: <a href="https://github.com/squarepegsys/literate-dotfiles/blob/master/aliases.org">aliases.org</a></p><p>Return to <a href="index.html">index</a>.</p>
</footer>
</body>
</html>
